test-weserv.txt
Server Software:        nginx
Server Hostname:        localhost
Server Port:            8083

Document Path:          /?url=http://origin/1700KB.jpg&w=854&h=480&fit=cover
Document Length:        23809 bytes

Concurrency Level:      10
Time taken for tests:   16.085 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      4856600 bytes
HTML transferred:       4761800 bytes
Requests per second:    12.43 [#/sec] (mean)
Time per request:       804.252 [ms] (mean)
Time per request:       80.425 [ms] (mean, across all concurrent requests)
Transfer rate:          294.86 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   193  768 355.8    684    1796
Waiting:      193  768 355.8    684    1796
Total:        193  768 355.8    684    1797